package Task3;

public class DocumentWorker {

    public void openDocument(){
        System.out.println("The document has been opened");
    }
    public void editDocument(){
        System.out.println("Editing available in Pro version");
    }
    public void saveDocument(){
        System.out.println("Saving available in Pro version");
    }
}




   /* Створіть клас DocumentWorker.
        У тілі класу створіть три методу openDocument (), editDocument (), saveDocument ().
        У тіло кожного з методів додайте вивід на екран відповідних рядків: "Документ відкритий",
        "Редагування документа є у версії Про", "Збереження документа є у версії Про".
        Створіть похідний клас ProDocumentWorker.
        Перевизначите відповідні методи, при перевизначенні методів виводите наступні рядки:
        "Документ відредагований", "Документ збережений в старому форматі, збереження в інших форматах
        доступно у версії Експерт ".
        Створіть похідний клас ExpertDocumentWorker від базового класу ProDocumentWorker.
        Перевизначите відповідний метод. При виклику даного методу необхідно виводити на екран
        "Документ збережений в новому форматі".
        У тілі методу main () реалізуйте можливість прийому від користувача номера ключа доступу pro і exp.
        Якщо користувач не вводить ключ, він може користуватися тільки безкоштовною версією (створюється
        екземпляр базового класу), якщо користувач ввів номера ключа доступу pro і exp, то повинен створитися
        екземпляр відповідної версії класу.*/